Autodesk.Revit.DB.Analysis.ConceptualSurfaceType.GetByMassSubCategoryId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Get the ConceptualSurfaceType by its mass subcategory id.
cda:
The document.
massSubCategoryId:
The mass subcategory id to get the ConceptualSurfaceType for.
Returns:
Returns ConceptualSurfaceType associated with input id or NULL.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The mass sub-category is none of the
OST_MassInteriorWall,
OST_MassExteriorWall,
OST_MassExteriorWallUnderground,
OST_MassRoof,
OST_MassFloor,
OST_MassSlab,
OST_MassShade,
OST_MassGlazing,
OST_MassSkylights,
or OST_MassOpening.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualSurfaceType.DefaultConstructionTypeId
The element id of the user specified ConceptualConstructionType to be used by default on creation for mass faces of this mass subcategory.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input element is not a constructionType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012